{"description": "A broctl plugin that helps you troubleshoot common problems", "tags": "broctl plugin, troubleshoot", "version": "2.0.4", "depends": ["j-gras/add-node-names *"], "test_cmd": null, "build_cmd": null, "url": "https://github.com/ncsa/bro-doctor", "summary": null, "script_dir": null, "plugin_dir": ".", "readme": "\n# Bro Doctor\n\nThis plugin provides a \"doctor\" command for broctl that will help to\ntroubleshoot various common cluster problems.\n\nThis plugin runs the following checks:\n## check_SAD_connections\nChecks if many recent connections have a SAD or had history\n\nIf any connections have a history that is one sided (all uppercase or all lowercase)\nthis indicates that bro is only seeing half of the connection.\n\n## check_capture_loss\nChecks for recent capture_loss.log entries\n\nCapture loss should be as low as possible across all workers.\n\n## check_capture_loss_conn_pct\nChecks what percentage of recent tcp connections show loss\n\nLike capture loss, but instead of reporting on the absolute loss amount,\nreport on the percentage of recent connections show any loss at all.\n\n## check_deprecated_scripts\nChecks if anything is in the deprecated local-logger.bro, local-manager.bro, local-proxy.bro, or local-worker.bro scripts\n\nUnless you know what you are doing, you should ONLY be using local.bro.\n\n## check_duplicate_5_tuples\nChecks if any recent connections have been logged multiple times\n\nEach connection should only be logged once.  If a connection is logged multiple times,\nespecially once per worker, load balancing is not working properly.\n\n## check_connection_distribution\nChecks if connections are unevenly distributed across workers\n\nUsually, connections should be distributed evenly across workers. If connections are\nunevenly distributed, load balancing might be not working properly.\n\n## check_local_connections\nChecks what percentage of recent tcp connections are remote to remote.\n\nThis will detect problems with networks.cfg not listing all subnets that should be\nconsidered local.\n\n## check_malloc\nChecks if bro is linked against a custom malloc like tcmalloc or jemalloc\n\nBro performs best when using a better malloc than the standard one in glibc.\n\n## check_pfring\nChecks pf_ring configuration\n\nIf bro is configured to use pf_ring, it needs to be linked against it.\nIf bro is linked against pf_ring, it should be using it.\n\nIf the bro pf_ring plugin is installed, the interface name should start with pf_ring::\n\n## check_reporter\nChecks for recent reporter.log entries\n\nIf bro is running well, there will be zero reporter.log messages.\n\n\n# Usage\n\n    broctl doctor [check] [check]\n\n## Examples\nRun all checks\n\n    broctl doctor\n\nRun just the duplicate check\n\n    broctl doctor check_duplicate_5_tuples\n\n\n"}