{"description": "MISP+Zeek. Dovehawk is a Zeek Module to import MISP indicators to the Intel Framework and Signature Framework automatically. Reports sightings directly back to MISP as they happen. Supports Zeek Clusters.", "tags": "intel, MISP, sightings, signatures, threat intelligence, threat intel, cyber", "version": "1.02.002", "depends": null, "test_cmd": null, "build_cmd": null, "url": "https://github.com/tylabs/dovehawk", "summary": null, "script_dir": ".", "plugin_dir": null, "readme": "# Dovehawk Zeek Module\n\nThreat Hunting with Zeek (Bro) and MISP\n\n\nThis module uses Zeek's built-in Intelligence Framework to load and monitor signatures from MISP automatically. Indicators are downloaded from MISP every 4 hours and hits, called sightings, are reported back to MISP immediately. The module also includes a customized version of Jan Grashoefer's expiration code to remove indicators after they are deleted from MISP.\n\n\nIndicators are downloaded and read into memory.  Content signatures in signatures.sig are MISP Network Activity->zeek items downloaded from MISP.  The event text should start with \"MISP:\" (see Sample Content Signature section for an example).  Zeek must be restarted to ingest the content signatures.  To do this automatically we recommend restarting Zeek using zeekctl and a restart cron described in included file [INSTALL.md](https://raw.githubusercontent.com/tylabs/dovehawk/master/INSTALL.md)\n\n\nOptional Slack.com web hook reporting.\n\n![Sticker 1](https://raw.githubusercontent.com/tylabs/dovehawk/master/docs/images/dovehawk_sticker1.png \"Sticker 1\") ![Sticker 2](https://raw.githubusercontent.com/tylabs/dovehawk/master/docs/images/dovehawk_sticker2.png \"Sticker 2\")\n\n\n\n## Screencaps\n\n### Dovehawk Downloads Indicators From MISP\n\n![Dovehawk signature download](https://raw.githubusercontent.com/tylabs/dovehawk/master/docs/images/dovehawk_launch.png \"Dovehawk startup\")\n\n### Dovehawk Sighting Uploaded\n\n![Dovehawk hit and sighting upload](https://raw.githubusercontent.com/tylabs/dovehawk/master/docs/images/dovehawk_hit.png \"Dovehawk hit\")\n\n### MISP Sighting\n\n![MISP sightings](https://raw.githubusercontent.com/tylabs/dovehawk/master/docs/images/misp_sightings.png \"MISP Sightings\")\n\n\n### Slack Web Hook\n\n![Slack Web Hook](https://raw.githubusercontent.com/tylabs/dovehawk/master/docs/images/slack_hit.png \"Slack Output\")\n\n\n### Intel Item Expiration\n\n![Items expiring](https://raw.githubusercontent.com/tylabs/dovehawk/master/docs/images/expire.png \"Expiration\")\n\n\n## Sample Content Signature\n\n```zeek\nsignature eicar_test_content {\n  ip-proto == tcp\n  payload /.*X5O\\!P%@AP\\[4\\\\PZX54\\(P\\^\\)7CC\\)7\\}\\$EICAR\\-STANDARD\\-ANTIVIRUS\\-TEST\\-FILE\\!\\$H\\+H\\*/\n  event \"MISP: eicar test file in TCP plain text\"\n}\n```\n*Note: Zeek's default setting is to buffer the [first 1024 bytes of a TCP connection](https://www.zeek.org/sphinx-git/frameworks/signatures.html) so signature's should be written with that in mind.*\n\n## Indicator Expiration\n\nIndicators are downloaded automatically every 4 hours and are assigned an expiry of 4.5 hours.  A check for expired indicators occurs every 4.5 hours to cleanup any expired indicators between downloads.  As indicators are reingested the expiration time is reset to 4.5 hours.  A message is now printed for each expired indicator.\n\nIf an indicator is hit after expiration but before the cleanup, it will trigger a hit/sighting, but the indicator is then deleted immediately so no further hits will occur.\n\nIntervals are set in config.zeek.\n\n### Setting for expired indicator cleanup (should be less then signature_refresh_period)\n\n```zeek\nredef Intel::item_expiration = 4.5 hr\n```\n\n\n### Setting for MISP download interval\n\n```zeek\nglobal signature_refresh_period = 4hr &redef;\n```\n\n\n### Setting for indicator expiration: (should be slightly more than signature_refresh_period)\n\n```zeek\nredef Intel::item_expiration = 4.5 hr;\n```\n\n\n### Maximum number of hits for an individual item per refresh period\n\n```zeek\nglobal MAX_HITS: int = 100;\n```\n\n### Maximum number of DNS hits for an individual item per refresh period\n\n```zeek\nglobal MAX_DNS_HITS: int = 2;\n```\n\n### Maximum number of inbound IP hits for an individual item per refresh period\n\n```zeek\nglobal MAX_SCAN_HITS: int = 2;\n```\n\n### Ignore hits in SSL certificate when domains don't match the sni host\n\n```zeek\nglobal IGNORE_SNI_MISMATCH: bool = T;\n```\n\n### Ignore CURL SSL Certificate Warnings\n\n```zeek\nglobal CURL_INSECURE: bool = T;\n```\n\n\n## Official Source\n\n<https://github.com/tylabs/dovehawk/>\n\n\n## Related Projects\n\n[MISP](https://raw.githubusercontent.com/tylabs/dovehawk/master/http://www.misp-project.org/)\n\n[Zeek Network Security Monitor](https://www.zeek.org/)\n\n[Zeek Package Manager](https://packages.zeek.org) - Zeek Packages to add on functionality.\n\n[Zeek Cluster and Recommended Hardware](https://docs.zeek.org/en/stable/cluster/)\n\n[MISP Sightings](https://www.circl.lu/doc/misp/sightings/) - Sightings are feedback on threat intelligence activity seen.\n\n\n\n# Special Thanks\n\nThe entire MISP team and Alexandre Dulaunoy [@adulau](https://twitter.com/adulau) for adding the zeek datatype to MISP.\n\n\n# License\n\nCopyright &copy; 2018, 2019, 2020, 2021. [@tylabs](https://twitter.com/tylabs)\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\n"}