{"description": "Protocol analyzer that detects, dissects, fingerprints, and logs GQUIC traffic", "tags": null, "version": "master", "depends": ["zkg >=2.0", "zeek >=4.0.0"], "test_cmd": null, "build_cmd": "./configure && make", "url": "https://github.com/salesforce/GQUIC_Protocol_Analyzer", "summary": null, "script_dir": "scripts/Salesforce/GQUIC", "plugin_dir": null, "readme": "# GQUIC Protocol Analyzer\nThis analyzer parses GQUIC traffic in Zeek for logging and detection purposes.  It examines the initial exchange between a client and server communicating over GQUIC, and extracts the information contained in the connection's client hello packet and  server rejection packet.  Currently, this protocol analyzer supports GQUIC versions Q039 to Q046.\n\n## Installing the GQUIC Protocol Analyzer using Source Tree\n\n##### For a standard installation\n\n ```sh\n./configure --zeek-dist=/path/to/zeek/dist\nmake\nmake install\n```\n\n##### To see all options, including setting the install path, run:\n ```sh\n./configure --help\n```\n## CYU\nTo provide further insight and help detect anomalous (and potentially malicious) GQUIC traffic, fingerprinting is utilized.  The fingerprinting method, named \"CYU\" works by identifying the GQUIC version and tags present in client hello packets.  First, the version of the packet is extracted, immediately followed by a comma.  After this, each tag in the client hello packet is gathered and concatenated together with hyphens to delimit each tag.  For example: `46,PAD-SNI-STK-VER-CCS-NONC-AEAD-UAID-SCID-TCID-PDMD-SMHL-ICSL-NONP-PUBS-MIDS-SCLS-KEXS-XLCT-CSCT-COPT-CCRT-IRTT-CFCW-SFCW`.  After this string is created, it is then MD5 hashed to produce an easily shareable fingerprint.  Hashing the previous string results in a CYU value of `a46560d4548108cf99308319b3b85346`.  This is the most common fingerprint, making up the vast majority of GQUIC traffic.\n\n### Use case: Merlin C2\nThe CYU fingerprinting method can be very useful when it comes to detecting beacons transmitting to servers over GQUIC.  For example, Merlin C2 clients use very few tags in their client hellos, giving them an anomalous fingerprints.\nKnown Merlin beacon fingerprints: `e030dea1f2eea44ac7db5fe4de792acd`, `0811fab28e41e8c8a33e220a15b964d9`, `d8b208b236d176c89407500dbefb04c2`.\n\n## New Events Created\nThe GQUIC protocol analyzer adds new four events which can be called in Zeek scripts.\n### gquic_packet\n```sh\nevent (c: connection, is_orig: bool, hdr: GQUIC::PublicHeader)\n```\nGenerated whenever a regular GQUIC packet is raised.\n* **c**: The connection.\n* **is_orig**: True if the event is raised for the originator side.\n* **hdr**: A data type which contains the packet number, connection ID, and version of a GQUIC packet.\n\n### gquic_client_version\n```sh\nevent event(c: connection, version: count)\n```\nRaised whenever a GQUIC client sends a Regular Packet with a novel GQUIC version number.\n* **c**: The connection.\n* **version**: The version number seen in the packet.\n\n### gquic_hello\n```sh\nevent (c: connection, is_orig: bool, hdr: GQUIC::PublicHeader, hello: GQUIC::HelloInfo);\n```\nGenerated whenever a client hello packet is detected in GQUIC traffic.  It includes the additional information contained in the hello packet.\n* **c**: The connection.\n* **is_orig**: True if the event is raised for the originator side.\n* **hdr**: A data type which contains the packet number, connection ID, and version of a GQUIC packet.\n* **hello**: A data type which contains the information about the tags of a client hello packet.\n\n### gquic_rej\n```sh\nevent (c: connection, is_orig: bool, hdr: GQUIC::PublicHeader, rej: GQUIC::RejInfo);\n```\nGenerated whenever a rejection packet (server hello) is detected in GQUIC traffic.  It includes the additional information contained in the rejection packet.\n* **c**: The connection.\n* **is_orig**: True if the event is raised for the originator side.\n* **hdr**: A data type which contains the packet number, connection ID, and version of a GQUIC packet.\n* **rej**: A data type which contains the information about the tags of a server rejection packet.\n\n## New Constants\nDefined in the init.zeek script, a constant named `skip_after_confirm` is set to true.  This means that only the initial exchange between the client and server will be captured.  This is done to reduce noise, but it also reduces some visibility.  It can be set to true as one sees fit.\n\n## New Types Created\nThe GQUIC protocol analyzer adds three new data types which can be referenced in Zeek scripts.\n### type: PublicHeader\n```sh\npkt_num: count\ncid: string &optional\nversion_exists: bool\nversion: count &optional\n```\n* **pkt_num**: The packet number in the GQUIC traffic.\n* **cid**: The unique, client-selected, connection ID which defines the connection.\n* **version_exists**: True if the version number is in the packet header.\n* **version**: The GQUIC version used by the packet and stream.\n\n### type: HelloInfo\n```sh\ntag:\tcount;\ntag_list: string;\npadding_len:\tcount;\nsni:\tstring &optional;\nstk:\tstring &optional;\nsno:\tstring &optional;\nver:\tstring &optional;\nccs:\tstring &optional;\nnonc:\tstring &optional;\nmspc:\tstring &optional;\naead:\tstring &optional;\nuaid:\tstring &optional;\nscid:\tstring &optional;\ntcid:\tstring &optional;\npdmd:\tstring &optional;\nsmhl:\tstring &optional;\nicsl:\tstring &optional;\nctim:\tstring &optional;\t\nnonp:\tstring &optional;\npubs:\tstring &optional;\nmids:\tstring &optional;\nscls:\tstring &optional;\nkexs:\tstring &optional;\nxlct:\tstring &optional;\ncsct:\tstring &optional;\ncopt:\tstring &optional;\nccrt:\tstring &optional;\nirtt:\tstring &optional;\ncetv:\tstring &optional;\ncfcw:\tstring &optional;\nsfcw:\tstring &optional;\n```\n* **tag**: The total number of tags found in the client hello packet\n* **tag_list**: This captures the list of tags and their offsets in the order which they appear in the client hello packet.\n* **padding_len**: The offset at which padding length starts.  Currently it is set to zero.\n* **sni**: The fully qualified DNS name of the server, canonicalized to lowercase with no trailing period. Internationalized domain names need to be encoded as A-labels defined in RFC 5890.\n* **stk**: The source-address token that the server has previously provided, if any.\n* **sno**: An echoed server nonce, if the server has provided one.\n* **ver**: The protocol version advertised by the client.\n* **ccs**: A series of 64-bit, FNV-1a hashes of sets of common certificates that the client possesses.\n* **nonc**: 32 bytes consisting of 4 bytes of timestamp (big-endian, UNIX epoch seconds), 8 bytes of server orbit and 20 bytes of random data.\n* **mspc**: The value through which each endpoint to independently set maximum number of supported streams.  Being replaced by MIDS (\"Maximum Incoming Dynamic Streams\").\n* **aead**: Contains the tag of the encryption algorithm to be used.\n* **uaid**: Contains the value of the user agent that sent the client hello packet.\n* **scid**: 16-byte identifier for the ID of the server configuration that the client is using.\n* **tcid**: Indicates support for truncated Connection IDs. If sent by a peer, indicates the connection IDs sent to the peer should be truncated to 0 bytes. Useful for cases when a client ephemeral port is only used for a single connection.\n* **pdmd**: A list of tags describing the types of proof acceptable to the client, in preference order. Currently only X509 is defined.\n* **smhl**: The value of support max header list (size).\n* **icsl**: The value denoting implicit shutdown.  The default idle timeout for a QUIC connection is 30 seconds. The maximum is 10 minutes. If there is no network activity for the duration of the idle timeout, the connection is closed.\n* **ctim**: The value of the client timestamp.\n* **nonp**: The 32 byte value of the client proof nonce.\n* **pubs**: The client’s public value for the given key exchange algorithm.  24-bit, little-endian length prefixed, in the same order as in KEXS.  P-256 public values, if any, are encoded as uncompressed points in X9.62 format.\n* **mids**: The value of the set maximum number of supported incoming streams.\n* **scls**: The value which permits a silent close upon timeout.\n* **kexs**:  The selected tag of the key exchange algorithm to be used.  Currently defined tags include C255 and P256.\n* **xlct**:  A 64-bit,  FNV-1a hash of the leaf certificate that the client expects the server to be using. The full contents of the certificate will be added into the HMAC-based key derivation function. If cached certificates are present, the first such entry should be identical to the value of this field.\n* **csct**:  The value of the signed cert timestamp, which is often missing.\n* **copt**:  The field contains any connection options being requested by the client or server.  These are typically used for experimentation and will evolve over time.  Example use cases include changing congestion control algorithms and parameters such as initial window.\n* **ccrt**:  A series of 64-bit, FNV-1a hashes of cached certificates for this server.\n* **irtt**:  The value of the estimated initial round trip time for the connection.\n* **cetv**:  Specifies client certificates, Channel IDs and other non-public data in the client hello and encrypted using the AEAD. \n* **cfcw**: The size in bytes of the connection level flow control window.\n* **sfcw**: The size in bytes of the stream level flow control window.\n\n### type: RejInfo\n```sh\ntag_count: count;\ntag_list: string; \nstk:\tstring &optional;\nsno:\tstring &optional;\nsvid:\tstring &optional;\nprof:\tstring &optional;\nscfg:\tstring &optional;\nrrej:\tstring &optional;\nsttl:\tstring &optional;\ncsct:\tstring &optional;\nver:\tstring &optional;\naead:\tstring &optional;\nscid:\tstring &optional;\npdmd:\tstring &optional;\ntbkp:\tstring &optional;\npubs:\tstring &optional;\nkexs:\tstring &optional;\nobit:\tstring &optional;\nexpy:\tstring &optional;\t\nembedded_count:\tcount &optional;\n```\n* **tag_count**: The total number of tags found in the rejection packet\n* **tag_list**: This captures the list of tags and their offsets in the order which they appear in the server rejection packet.  Does not include tags found under SCFG.\n* **stk**: An opaque byte string that the client should echo in future client hello messages.\n* **sno**: The server may set a nonce, which the client should echo in any future client hello messages. This allows a server to operate without a strike-register and for clients with clock-skew to connect.\n* **svid**: The SVID tag was once found in a pcap of Merlin C2 traffic.  This tag is not currently supported by Wireshark.\n* **prof**: In the case of X.509, a signature of the server config by the public key in the leaf certificate. The format of the signature is currently fixed by the type of public key.  \n* **scfg**: A message containing the server’s serialized config with its own set of tag/value pairs.  \n* **rrej**: The value which signifies why the server sent the rejection packet. \n* **sttl**: The duration, in seconds, that the server config is valid for. \n* **csct**: The value of the signed certificate timestamp (defined by RFC 6962) of the leaf certificate\n* **ver**: Lists the versions that the server is able to use.\n* **aead**: A list of tags, in preference order, specifying the AEAD primitives supported by the server.\n* **scid**: 16-byte identifier for this server configuration.\n* **pdmd**: Used for finding proof acceptable to the client. Currently only X509 is defined.\n* **tbkp**: Value of the token.\n* **pubs**: A list of public values, 24-bit, little-endian length prefixed, in the same order as in KEXS. P-256 public values, if any, are encoded as uncompressed points in X9.62 format.\n* **kexs**: The selected tag of the key exchange algorithm to be used.  Currently defined tags include C255 and P256.\n* **obit**: An 8-byte, opaque value that identifies the strike-register.\n* **expy**: A 64-bit expiry time for the server config in UNIX epoch seconds.\n* **embedded_count**: The number of tags/value pairs defined in the server config message.\n\n\n## Credits\nCreated by:\n* [Caleb Yu](https://www.linkedin.com/in/caleb-yu)\n\nWith assistance from:\n* [John Althouse](https://twitter.com/4A4133)\n* [Rakesh Passa](https://twitter.com/Sithari443)\n* The [Corelight Team](https://github.com/corelight/bro-quic)\n* Salesforce Threat Detection Team\n\n### References:\n* https://docs.google.com/document/d/1g5nIXAIkN_Y-7XJW5K45IblHd_L2f5LTaDUDwvZ5L6g\n* https://docs.google.com/document/d/1WJvyZflAO2pq77yOLbp9NsGjC1CHetAXV8I0fQe-B_U\n"}