{"description": "Per item expiration for Zeek's intelligence framework.", "tags": "intel, expiration", "version": "v1.0.0", "depends": ["zeek >=3.0"], "test_cmd": "cd testing && btest -d", "build_cmd": null, "url": "https://github.com/J-Gras/intel-expire", "summary": null, "script_dir": "scripts", "plugin_dir": null, "readme": "# Intel Expire\n\nThis package provides an expiration mechanism for Zeek's intelligence framework on per item basis.\n\n## Installation\n\nThe scripts are available as package for the [Zeek Package Manager](https://github.com/zeek/package-manager) and can be installed using the following command: `zkg install intel-expire`\n\n## General Usage\n\nTo enable per item expiration make sure the package is loaded: `zkg load intel-expire`\n\nOnce enabled, intel items might specify a new meta data field `meta.expire`, which indicates the expiration interval in seconds. The following example shows an intel file that contains two IPs that are valid for different timespans.\n```\n#fields\tindicator\tindicator_type\tmeta.source\tmeta.desc\tmeta.expire\n10.0.0.23\tIntel::ADDR\tsource_a\tThis host is bad\t600\n10.0.0.42\tIntel::ADDR\tsource_b\tThis host is bad\t18000\n```\nOnce an item expires, the hook `single_item_expired` is called. If all hook handlers are executed, the expiration timeout will be reset. Otherwise, if one of the handlers terminates using `break`, the item will be removed. This allows to make use of per item expiration for executing arbitrary actions.\n\n**NOTE:** As described above, item expiration will _not_ cause that the item is removed upon expiration by default. If you would like to remove expired items add the following to your `local.zeek`\n```\n@load packages/intel-expire/delete-expired\n```\nor break the chain of hook handlers manually:\n```\nhook Intel::single_item_expired(item: Intel::Item)\n\t{\n\t# Trigger item deletion\n\tbreak;\n\t}\n```\n\n## Extensions\n\nThe following additional scripts can be used to further customize the behavior of per item expiration:\n\n* `delete-expired`: Expired items will be deleted.\n* `reset-on-match`: Matching an item will reset its expiration timeout.\n\n## Background\n\nThe script `item-expire.zeek` implements per item expiration and is loaded by default. Per item expiration is realized using two additional meta data fields:\n* `expire` defines the expiration interval in seconds\n* `start_time` represents the start timestamp of the expiration\n\nTo make sure that an expired item does not match, the script handles the `extend_match` hook of the intelligence framework and checks whether the item to match has already expired with regard to its expiration start time and expiration interval.\nThe term item refers to the combination of an indicator and a corresponding meta data instance (see [blog post](https://blog.zeek.org/2016/12/the-intelligence-framework-update.html) for details about the internal data model of the intelligence framework).\nIf the item has expired, the `single_item_expired` hook is called. As previously described, breaking the chain of hooks will cause the item under consideration to be removed. Otherwise, expiration is reset by setting the start timestamp to to current network time. Updating the meta data is implemented using the intelligence framework's `insert` function. Note that this does _not_ cause the item to be redistributed in the cluster, because only the item's meta data is updated.\n\nAt this point, the `single_item_expired` hook would never be called if the corresponding item is not matched. If expiration is used to delete items, deletion would not be triggered and items would pile up. To prevent this, the script implements a mechanism akin to garbage collection using the intelligence framework's global expiration.\nSetting the `item_expiration` timeout to 10 minutes by default, the `item_expired` hook is called regularly for each indicator. In context of the hook the expiration for each indicator and meta data combination is checked and per item expiration is triggered accordingly. Thus, the garbage collection behavior can be influenced by tuning the global item expiration timeout.\n\nFor further details see the test cases contained in the package.\n"}