{"description": "The script will create a new log which will log the details which build the fingerprint and some additional information. The fingerprint is created by concatenating extracted fields from different data packets.  https://github.com/yahoo/rdfp", "tags": null, "version": "master", "depends": null, "test_cmd": null, "build_cmd": null, "url": "https://github.com/theparanoids/rdfp", "summary": null, "script_dir": "scripts", "plugin_dir": null, "readme": "# rdfp\nZeek Remote desktop fingerprinting script based on FATT (Fingerprint All The Things).\nhttps://github.com/0x4D31/fatt\n\n## Background\nThis is the result of a collaboration with Adel K. while he was working on FATT's remote desktop fingerpinting.  This is a Zeek package to be used to fingerprint the Remote Desktop clients.\n\nPlease reference Microsoft's RDP specification located below.\n\nhttps://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-rdpbcgr/5073f4ed-1e93-45e1-b039-6e30c385867c\n\n\n## Install\nzkg install https://github.com/yahoo/rdfp\nAdd \"**@load ./rdfp**\" to local.bro.\n\n## How It Works\n\nThe script will create a new log which will log the details which build the fingerprint and some additional information.  The fingerprint is created by concatenating extracted fields from different data packets.  \n\nFirst the Client Core Data packet is parsed and extracts the Major and Minor version of the client.  Next the Client Security Data is parsed and the Encryption Method and a list of the flags are added.  This is followed by the Client Cluster Data flags.  This is followed by the extEncryptionMethods value which is defined specifically for French locale clients.  The last group of data is the Channel Definition options for each channel defined which provide details about the data transport.\n\nHere is an example output based on the [rdp_proprietary-encryption.pcap](https://github.com/zeek/zeek/tree/master/testing/btest/Traces/rdp) provided by Zeek.org.\n\n```4,8,0000001b,0000000d,00000000,rdpdr:80800000-rdpsnd:c0000000-drdynvc:c0800000-cliprdr:c0a00000```\n\nAssociated MD5 hash\n\n```471a0d621e6184364949f1a62040e7f6```\n\nSample rdfp.log based on the same pcap file.\n\n```#separator \\x09\n#set_separator\t,\n#empty_field\t(empty)\n#unset_field\t-\n#path\trdfp\n#open\t2020-02-04-14-52-01\n#fields\tid.orig_h\tid.orig_p\tid.resp_h\tid.resp_p\tcookie\tverMajor\tverMinor\tclusterFlags\tencMethods\textEncMethods\tchannelDef\trdfp_string\trdfp_hash\n#types\taddr\tport\taddr\tport\tstring\tint\tint\tstring\tstring\tstring\tstring\tstring\tstring\n172.21.128.16\t1312\t10.226.24.52\t3389\tFTBCO\\\\A70\t4\t8\t0000000d\t0000001b\t00000000\trdpdr:80800000-rdpsnd:c0000000-drdynvc:c0800000-cliprdr:c0a00000\t4,8,0000001b,0000000d,00000000,rdpdr:80800000-rdpsnd:c0000000-drdynvc:c0800000-cliprdr:c0a00000\t471a0d621e6184364949f1a62040e7f6\n#close\t2020-02-04-14-52-01\n```\n\n## Disclaimer\n\nThis technique is specifically for non-TLS encrypted RDP sessions. For SSL/TLS encrypted RDP sessions refer to the JA3 fingerprint technique.  https://github.com/salesforce/ja3\n\n## Contribute\nPlease refer to the CONTRIBUTING.md file for information about how to get involved. We welcome issues, feature requests, pull requests, and documentation updates in GitHub.\n\n## License\n\nThis project is licensed under the terms of the Apache 2.0 open source license. Please refer to LICENSE for the full terms.\n"}