{"description": "Detect US Social Security numbers in HTTP and SMTP with Bro.", "tags": "ssn, social security number, dlp, files", "version": "1.0.1", "depends": null, "test_cmd": null, "build_cmd": null, "url": "https://github.com/sethhall/ssn-exposure", "summary": null, "script_dir": "scripts", "plugin_dir": null, "readme": "SSN Exposure\n============\n\nDetect US Social Security Numbers with Zeek.  This script only works with Zeek 3.0+.\n\nInstallation\n------------\n\nZeek Package Manager\n********************\n\nThis is a test for the new Zeek package manager.  If you don't have the package\nmanager and you don't want to work with early code please use the alternate \nmanual installation method.\n\n::\n\n\tzkg refresh\n\tzkg install ssn-exposure\n\nAlternate Manual Installation\n*****************************\n\n::\n\n\tcd <prefix>/share/zeek/site/\n\tgit clone git://github.com/sethhall/ssn-exposure.git\n\techo \"@load ssn-exposure\" >> local.zeek\n\nAfter the ssn-exposure module is loaded, follow the configuration examples below.  One or both of the following options must be done or the script won't do anything.\n\nConfiguration\n-------------\n\nThere are some configuration options that you will likely want to pay attention to.  In particular, it's likely that you will want to configure the SsnExposure::prefixes variable unless you have a list of relevant SSNs for your organization in which case you will want to configure the SsnExposure::ssn_file variable to point to a file on disk with a list of SSNs that are relevant for you.\n\nExamples\n--------\n\nPrefix configuration\n~~~~~~~~~~~~~~~~~~~~\n\nThis method is more prone to false positives than the next method, but it's quick and easy to begin using after finding the relevant state prefixes from: http://www.mrfa.org/ssn.htm\n\nConfigure likely state prefixes in local.zeek::\n\n\tredef SsnExposure::prefixes += {\n\t\t[$state=\"Ohio\",         $low=268, $high=302],\n\t\t[$state=\"Pennsylvania\", $low=159, $high=211],\n\t};\n\nSSN list configuration\n~~~~~~~~~~~~~~~~~~~~~~\n\nA list of \"known SSNs\" which will be used for validation after candidate values are extracted from the network.\n\nConfigure the SSN list file in local.zeek::\n\n\tredef SsnExposure::ssn_file = \"/var/data/ssn-list.txt\";\n\nCreate the ssn-list.txt (or whatever file you referenced above)::\n\n\t123456789\n\t123456788\n\t123456777\n\t123456666\n\nThis file will be reread everytime it changes at runtime so updates do not require a restart.\n"}