{"description": "Zeek Package that extracts features of IRC communication", "tags": "zeek plugin, irc, features extraction", "version": "v1.6", "depends": null, "test_cmd": null, "build_cmd": null, "url": "https://github.com/stratosphereips/zeek-package-IRC", "summary": null, "script_dir": null, "plugin_dir": null, "readme": "# zeek-package-IRC\n\nIRC Feature Extractor Zeek Package extends the functionality of Zeek network analysis framework. This package automatically recognizes IRC communication in a packet capture (pcap) file and automatically extract features from it.\nThe goal for the feature extraction is to describe an individual IRC communications that occur in the pcap file as accurately as possible.\n\n## Installation\nTo install the package using [Zeek Package Manager](https://packages.zeek.org), run the following command:\n```bash\n$ zkg install IRC-Zeek-package\n```\n## Run\nTo extract the IRC features on the selected pcap file that contains IRC, run the following command in a terminal:\n```bash\n$ zeek IRC-Zeek-package -r file.pcap \n```\nThe output will be stored in  `irc_features.log` file in zeek log format. The log will look like this: \n\n```\n#separator \\x09\n#set_separator\t,\n#empty_field\t(empty)\n#unset_field\t-\n#path\tirc_features\n#open\t2020-01-27-21-54-41\n#fields\tsrc\tsrc_ip\tsrc_ports_count\tdst\tdst_ip\tdst_port\tstart_time\tend_time\tduration\tmsg_count\tsize_total\tperiodicity\tspec_chars_username_mean\tspec_chars_msg_mean\tmsg_word_entropy\n#types\tstring\taddr\tcount\tstring\taddr\tport\ttime\ttime\tdouble\tcount\tint\tdouble\tdouble\tdouble\tdouble\nT!T@null\t192.168.100.103\t4\t#a925d765\t111.230.241.23\t2407\t1532322898.819018\t1534860900.996931\t2538002.177913\t23\t48705\t0.050294\t0.25\t0.908075\t2.001506\nT!T@null\t192.168.100.103\t33\t#a925d765\t185.61.149.22\t2407\t1530166710.153128\t1535620500.535362\t5453790.382234\t231\t562890\t1.0\t0.25\t0.908256\t2.276218\n#close\t2020-01-27-21-54-41\n\n```\n\n### Parsing log in Python\n\nInstead of parsing the package manually, you can use the [ZAT](https://github.com/SuperCowPowers/zat) library  in Python to parse it directly into a Pandas data frame or as a list of dictionaries.\n\nThere is an example of how to parse the log as a list of dictionaries:\n\n\n```python\nimport zat\nfrom zat.log_to_dataframe import LogToDataFrame\nfrom zat.bro_log_reader import BroLogReader\n\n\nlog_filename = 'irc_features.log'\n\nlogs_arr = []\nreader = BroLogReader(log_filename)\n\nfor log in reader.readrows():\n    # log is in dictionary format\n    print(log)\n    logs_arr.append(log) \n```\n\n## Description\nOnce the data was obtained from network traffic capture, there was a process to extract the features. We separated the whole pcap into communications for each individual user. To do that, we separated communication into the connections between the source IP, destination IP, and destination port (hereinafter IRC connection). The source port is randomly chosen from the unregistered port range, and that is why the source port is not the same when a new TCP connection is established between the same IP addresses. For this reason, we neglected the source port to match the IRC connection with the same source IP, destination IP, and destination port. This is shown in figure below, where are two connections from the source IP address (192.168.0.1), to the same destination IP address (192.168.0.2) using different source port.\n\n\n![alt](https://raw.githubusercontent.com/stratosphereips/zeek-package-IRC/master/figs/irc-connection.png)\n\nExample of IRC connection - IRC connection that is defined by source IP address 192.168.0.1, destination IP address 192.168.0.2, and destination port 440. Source port is neglected, and therefore one IRC connection can have multiple source ports. The IP addresses and ports are chosen randomly for demonstration purposes.\n\n## Extracted Features\nThe feature selection is made manually to provide a good means of characterizing malicious communication. Features were computed for each IRC connection. Here is a final list of features that we used in our models.\n### Total Packet Size\nSize of all packets in bytes that were sent in IRC connection. It reflects how many messages were sent and how long they were.\n### Session Duration\nDuration of IRC connection in milliseconds - i.e., the difference between the time of the last message and the first message in IRC connection.\n### Number of Messages\nA total number of messages in IRC connection.\n### Number of Source Ports\nAs we have mentioned before, the source port is neglected in unifying communication into IRC connections because the it is randomly chosen when a TCP connection is established. We suppose that artificial users could have had a higher number of source ports than the real users since the number of connections of the artificial users was higher than the number of connections of the real users.\n### Message Periodicity\nWe suppose that artificial users (e.g., bots that are controlled by botnet master) use IRC for sending commands periodically, so we wanted to obtain that value. To do that, we created a method that would return a number between 0 and 1 - i.e. one if the message sequence is perfectly periodical, zero if the message sequence is not periodical at all.\n\nTo compute message periodicity, we firstly compute time differences between every message. On this computed sequence of numbers, we apply a fast Fourier transform (FFT). The output of FFT is a sequence of numbers. The higher the number on the given position of the output, the bigger the amplitude on the given position.Thus it has a more significant influence on the periodicity of the data.\nThe position of the largest element in the FFT's output represents the length of the period, which is the most significant from all other periods. \n\nTo compute the quality of the most significant period, we split the data by length of that period.. Then we compute the normalised mean squared error (NMSE) that returns us the resulting number in the interval between 0 and 1 where 1 represents the perfectly periodic messages, and 0 represents not periodic messages at all.\n\n![](https://raw.githubusercontent.com/stratosphereips/zeek-package-IRC/master/figs/periodicity_sketch.png)\n\nIllustration of how message periodicity is computed. The time differences between messages and FFT output numbers are chosen randomly for demonstration purposes.\n\n### Message Word Entropy\nTo consider whether the user sends the same message multiple times in a row, or whether the message contains a limited number of words, we compute a word entropy across all of the messages in the IRC connection. By the term word entropy we mean a measure of  words uncertainty in the message. For the computation of the word entropy, we use the formula below:\n\n![](https://raw.githubusercontent.com/stratosphereips/zeek-package-IRC/master/figs/formula_entropy.gif)\n\nwhere n represents the number of words, and pi represents the probability that the word i will be used among all other words.\n### Username Special Characters Mean\nWe want to obtain whether the username of the user in the IRC communication is random generated or not. Therefore, in this feature, we compute the average usage of non-alphabetic characters in the username.  \n\n### Message Special Characters Mean\nWith this feature, we obtain the average usage of non-alphabetic characters across all messages in the IRC connection. We apply the same procedure of matching special characters for each message as in the previous case - we match non-alphabetic characters by regex, and then we divide the number of matched characters by the total number of message characters. Finally, we compute an average of all the obtained values for each message.\n"}